Revit 2027 API
ViewDisplayModel.ShowHiddenLines Property
 True to enable hidden lines. False to disable showing them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ShowHiddenLinesValues ShowHiddenLines { get; set; }
Public Property ShowHiddenLines As ShowHiddenLinesValues
	Get
	Set
public:
property ShowHiddenLinesValues ShowHiddenLines {
	ShowHiddenLinesValues get ();
	void set (ShowHiddenLinesValues value);
}
member ShowHiddenLines : ShowHiddenLinesValues with get, set
Property Value
ShowHiddenLinesValues
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewDisplayModel Class
Autodesk.Revit.DB Namespace